controllers/WordsController.php

INSERT INTO `words` (`word`, `translate`, `month`, `year`) VALUES ('table', 'стол', 'март', 2016)
SELECT 1 FROM `words` WHERE `word`='table'
---
    public function actionCreate()
    {
        $model = new Words();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `words` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Words::findOne($id)) !== null) {